In [1]:
import pandas as pd
import numpy as np

In [2]:
#creating a Series
a=[1,2,3,4,6]
var=pd.Series(a)
print(var)

0    1
1    2
2    3
3    4
4    6
dtype: int64

In [3]:
#Printing a sepcific Value
print(var[3])

4

In [4]:
#corresponding a indexs as index with var1
indexs = ["A", "B", "C", "d","E"]
var1=pd.Series(a,index=indexs)
print(var1)

A    1
B    2
C    3
d    4
E    6
dtype: int64

In [5]:
print(var1["A"])

1

In [6]:

car={"mercedes" : "Germany" , "tesla" : "USA", "toyota" : "japan" } 
var2=pd.Series(car) 

print(var2)

mercedes    Germany
tesla           USA
toyota        japan
dtype: object

In [7]:
print(var2["tesla"])

USA

***DataFrame**

In [9]:
#cretaing a dataframe using a random values
my_data= np.random.randn(5,4) 
my_rows=["A","B","C","D","E"]
my_columns=["Ram","Ravi","Sabin","Abhishek"]
new_var=pd.DataFrame(my_data,my_rows, my_columns)
new_var

        Ram      Ravi     Sabin  Abhishek
A -1.239803 -0.669675 -2.148316  0.047856
B  0.249473  0.054509  2.158352 -0.832607
C  0.508351 -0.554333  0.151347  1.381818
D -0.268159  1.160723 -0.514323  0.881597
E -1.007155  0.937558  0.068013  0.188254

In [10]:
#reading a existing csv file
my_Csv=pd.read_csv(r"C:\Users\khare\OneDrive\Desktop\Book1.csv")
my_Csv

       Name  age  marks
0      Ravi   19     98
1   Kushal    19     98
2     sabin   20     90
3   rajesh    21     86
4    Nikesh   20     86
5  abhishek   23     90

In [11]:
# pull out Data 
my_Csv.loc[1]

Name     Kushal
age           19
marks         98
Name: 1, dtype: object

In [12]:
my_Csv.loc[[0,5]]

       Name  age  marks
0      Ravi   19     98
5  abhishek   23     90

In [13]:
#grab first 5 row 
my_Csv.head()

      Name  age  marks
0     Ravi   19     98
1  Kushal    19     98
2    sabin   20     90
3  rajesh    21     86
4   Nikesh   20     86

In [14]:
#grab first 6 row
my_Csv.head(6)

       Name  age  marks
0      Ravi   19     98
1   Kushal    19     98
2     sabin   20     90
3   rajesh    21     86
4    Nikesh   20     86
5  abhishek   23     90

In [15]:
#grab last five rows
my_Csv.tail()

       Name  age  marks
1   Kushal    19     98
2     sabin   20     90
3   rajesh    21     86
4    Nikesh   20     86
5  abhishek   23     90

In [16]:

my_Csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [17]:
#To find shape of series
my_Csv.shape

(6, 3)

In [18]:
#dimension of series
my_Csv.ndim

2

In [19]:
my_Csv.dtypes

Name     object
age       int64
marks     int64
dtype: object

In [20]:
#statistisc of csv file
my_Csv.describe()

             age      marks
count   6.000000   6.000000
mean   20.333333  91.333333
std     1.505545   5.465040
min    19.000000  86.000000
25%    19.250000  87.000000
50%    20.000000  90.000000
75%    20.750000  96.000000
max    23.000000  98.000000

In [21]:
#statistics of specific value
my_Csv["marks"].describe()

count     6.000000
mean     91.333333
std       5.465040
min      86.000000
25%      87.000000
50%      90.000000
75%      96.000000
max      98.000000
Name: marks, dtype: float64

In [22]:
my_Csv["age"]

0    19
1    19
2    20
3    21
4    20
5    23
Name: age, dtype: int64

In [23]:
my_Csv.marks

0    98
1    98
2    90
3    86
4    86
5    90
Name: marks, dtype: int64

In [24]:
#printing a Specific Column
my_Csv.iloc[:,0]

0        Ravi
1     Kushal
2       sabin
3     rajesh
4      Nikesh
5    abhishek
Name: Name, dtype: object

In [25]:
#count
#Descending count
my_Csv["marks"].value_counts()

marks
98    2
90    2
86    2
Name: count, dtype: int64

In [26]:
#count
#Descending count
my_Csv["marks"].value_counts(ascending=True)

marks
98    2
90    2
86    2
Name: count, dtype: int64

In [27]:
#names with nan
my_Csv["marks"].value_counts(dropna=False)

marks
98    2
90    2
86    2
Name: count, dtype: int64

In [28]:
#finds The percentage 
my_Csv["marks"].value_counts(normalize=True)

marks
98    0.333333
90    0.333333
86    0.333333
Name: proportion, dtype: float64

In [29]:
#Specific Values 
my_Csv["marks"].value_counts()[90]

2

In [30]:
#number of repeated values 
my_Csv.groupby("marks").size()

marks
86    2
90    2
98    2
dtype: int64

In [31]:
my_Csv.groupby("Name").count()

          age  marks
Name
Kushal      1      1
Nikesh      1      1
Ravi        1      1
abhishek    1      1
rajesh      1      1
sabin       1      1

In [32]:
# my_Csv.apply(pd.value_counts)

In [33]:
#add new Column

In [34]:
#add column from list 
Names=["Good","average","good","also Good" ,"Bad","Average"]
my_Csv["Measure"]=Names

my_Csv

       Name  age  marks    Measure
0      Ravi   19     98       Good
1   Kushal    19     98    average
2     sabin   20     90       good
3   rajesh    21     86  also Good
4    Nikesh   20     86        Bad
5  abhishek   23     90    Average

In [35]:
#add default values

In [36]:
my_Csv["Pass/fail"]=[True]*len(my_Csv)
my_Csv

       Name  age  marks    Measure  Pass/fail
0      Ravi   19     98       Good       True
1   Kushal    19     98    average       True
2     sabin   20     90       good       True
3   rajesh    21     86  also Good       True
4    Nikesh   20     86        Bad       True
5  abhishek   23     90    Average       True

In [37]:
#Add nan values

In [38]:
my_Csv["hooby"]=[np.nan]*len(my_Csv) 
my_Csv

       Name  age  marks    Measure  Pass/fail  hooby
0      Ravi   19     98       Good       True    NaN
1   Kushal    19     98    average       True    NaN
2     sabin   20     90       good       True    NaN
3   rajesh    21     86  also Good       True    NaN
4    Nikesh   20     86        Bad       True    NaN
5  abhishek   23     90    Average       True    NaN

In [39]:
#add column with .insert() 
my_Csv.insert(4,"Nothing",[True]*len(my_Csv))
my_Csv

       Name  age  marks    Measure  Nothing  Pass/fail  hooby
0      Ravi   19     98       Good     True       True    NaN
1   Kushal    19     98    average     True       True    NaN
2     sabin   20     90       good     True       True    NaN
3   rajesh    21     86  also Good     True       True    NaN
4    Nikesh   20     86        Bad     True       True    NaN
5  abhishek   23     90    Average     True       True    NaN

In [40]:
#Add column with .assign() #create a new variable and store the data
new_var=my_Csv.assign(college=["don't know"]*len(my_Csv))
new_var

       Name  age  marks    Measure  Nothing  Pass/fail  hooby     college
0      Ravi   19     98       Good     True       True    NaN  don't know
1   Kushal    19     98    average     True       True    NaN  don't know
2     sabin   20     90       good     True       True    NaN  don't know
3   rajesh    21     86  also Good     True       True    NaN  don't know
4    Nikesh   20     86        Bad     True       True    NaN  don't know
5  abhishek   23     90    Average     True       True    NaN  don't know

In [41]:
#Delete colmn and row
#Var_Name.drop( )

In [42]:
# new_var.drop("hobby",axis=1)

In [43]:
new_var

       Name  age  marks    Measure  Nothing  Pass/fail  hooby     college
0      Ravi   19     98       Good     True       True    NaN  don't know
1   Kushal    19     98    average     True       True    NaN  don't know
2     sabin   20     90       good     True       True    NaN  don't know
3   rajesh    21     86  also Good     True       True    NaN  don't know
4    Nikesh   20     86        Bad     True       True    NaN  don't know
5  abhishek   23     90    Average     True       True    NaN  don't know

In [44]:
new_var.drop(4)

       Name  age  marks    Measure  Nothing  Pass/fail  hooby     college
0      Ravi   19     98       Good     True       True    NaN  don't know
1   Kushal    19     98    average     True       True    NaN  don't know
2     sabin   20     90       good     True       True    NaN  don't know
3   rajesh    21     86  also Good     True       True    NaN  don't know
5  abhishek   23     90    Average     True       True    NaN  don't know

In [45]:
#Grab Row, points, Subset

In [46]:
#Grab row method(1)
new_var.loc[0]

Name               Ravi
age                  19
marks                98
Measure            Good
Nothing            True
Pass/fail          True
hooby               NaN
college      don't know
Name: 0, dtype: object

In [47]:
#Grab row method(2)
new_var.iloc[3]

Name            rajesh
age                  21
marks                86
Measure       also Good
Nothing            True
Pass/fail          True
hooby               NaN
college      don't know
Name: 3, dtype: object

In [48]:
#Grab column method 
new_var["college"]

0    don't know
1    don't know
2    don't know
3    don't know
4    don't know
5    don't know
Name: college, dtype: object

In [49]:
#Grab column 2 method
new_var.iloc[:,0]

0        Ravi
1     Kushal
2       sabin
3     rajesh
4      Nikesh
5    abhishek
Name: Name, dtype: object

In [50]:
#Grab a specific points

In [51]:
new_var.loc[2,"marks"]

90

In [52]:
#Subset
new_var.loc[[0,4],["Name","marks"]]

     Name  marks
0    Ravi     98
4  Nikesh     86

In [53]:
#Conditional Selections
new_var== 90

    Name    age  marks  Measure  Nothing  Pass/fail  hooby  college
0  False  False  False    False    False      False  False    False
1  False  False  False    False    False      False  False    False
2  False  False   True    False    False      False  False    False
3  False  False  False    False    False      False  False    False
4  False  False  False    False    False      False  False    False
5  False  False   True    False    False      False  False    False

In [54]:
#Returns DataFrame with Data
new_var[new_var["marks"]> 90]

      Name  age  marks  Measure  Nothing  Pass/fail  hooby     college
0     Ravi   19     98     Good     True       True    NaN  don't know
1  Kushal    19     98  average     True       True    NaN  don't know

In [55]:
#Return Them on column 
new_var[new_var["marks"] == 90]["Name"]

2       sabin
5    abhishek
Name: Name, dtype: object

In [56]:
#return Multiple Column
new_var[new_var["marks"] == 90][["Name", "marks"]]

       Name  marks
2     sabin     90
5  abhishek     90

In [57]:
# Multiple Conditions
new_var[(new_var["marks"] >= 90) & (new_var["age"] ==20)]

    Name  age  marks Measure  Nothing  Pass/fail  hooby     college
2  sabin   20     90    good     True       True    NaN  don't know

In [58]:
#len
len(new_var[(new_var["marks"] >= 90) & (new_var["age"] ==20)])

1

In [59]:
#Multiple Condition OR
new_var[(new_var["marks"] >= 90) | (new_var["age"] ==20)]["Name"]

0        Ravi
1     Kushal
2       sabin
4      Nikesh
5    abhishek
Name: Name, dtype: object

In [60]:
len(new_var[(new_var["marks"] >= 90) | (new_var["age"] ==20)])

5

In [61]:
# #Reset ,Change index
# new_var.drop("college",axis=1,inplace=True)

In [62]:
new_var

       Name  age  marks    Measure  Nothing  Pass/fail  hooby     college
0      Ravi   19     98       Good     True       True    NaN  don't know
1   Kushal    19     98    average     True       True    NaN  don't know
2     sabin   20     90       good     True       True    NaN  don't know
3   rajesh    21     86  also Good     True       True    NaN  don't know
4    Nikesh   20     86        Bad     True       True    NaN  don't know
5  abhishek   23     90    Average     True       True    NaN  don't know

In [63]:
new_var.drop("Pass/fail", axis=1 , inplace=True)

In [64]:
new_var

       Name  age  marks    Measure  Nothing  hooby     college
0      Ravi   19     98       Good     True    NaN  don't know
1   Kushal    19     98    average     True    NaN  don't know
2     sabin   20     90       good     True    NaN  don't know
3   rajesh    21     86  also Good     True    NaN  don't know
4    Nikesh   20     86        Bad     True    NaN  don't know
5  abhishek   23     90    Average     True    NaN  don't know

In [65]:
new_var.drop("hooby", axis=1 , inplace=True)

In [66]:
new_var

       Name  age  marks    Measure  Nothing     college
0      Ravi   19     98       Good     True  don't know
1   Kushal    19     98    average     True  don't know
2     sabin   20     90       good     True  don't know
3   rajesh    21     86  also Good     True  don't know
4    Nikesh   20     86        Bad     True  don't know
5  abhishek   23     90    Average     True  don't know

In [67]:
new_var["Country"]=["USA","Canda","USA","Dubai","australia","Japan"]

In [68]:
new_var

       Name  age  marks    Measure  Nothing     college    Country
0      Ravi   19     98       Good     True  don't know        USA
1   Kushal    19     98    average     True  don't know      Canda
2     sabin   20     90       good     True  don't know        USA
3   rajesh    21     86  also Good     True  don't know      Dubai
4    Nikesh   20     86        Bad     True  don't know  australia
5  abhishek   23     90    Average     True  don't know      Japan

In [69]:
new_var.set_index("Name")

          age  marks    Measure  Nothing     college    Country
Name
Ravi       19     98       Good     True  don't know        USA
Kushal     19     98    average     True  don't know      Canda
sabin      20     90       good     True  don't know        USA
rajesh     21     86  also Good     True  don't know      Dubai
Nikesh     20     86        Bad     True  don't know  australia
abhishek   23     90    Average     True  don't know      Japan

In [70]:
new_var.reset_index()

   index      Name  age  marks    Measure  Nothing     college    Country
0      0      Ravi   19     98       Good     True  don't know        USA
1      1   Kushal    19     98    average     True  don't know      Canda
2      2     sabin   20     90       good     True  don't know        USA
3      3   rajesh    21     86  also Good     True  don't know      Dubai
4      4    Nikesh   20     86        Bad     True  don't know  australia
5      5  abhishek   23     90    Average     True  don't know      Japan

In [71]:
new_var.drop("Nothing" ,axis=1, inplace=True)

In [72]:
new_var

       Name  age  marks    Measure     college    Country
0      Ravi   19     98       Good  don't know        USA
1   Kushal    19     98    average  don't know      Canda
2     sabin   20     90       good  don't know        USA
3   rajesh    21     86  also Good  don't know      Dubai
4    Nikesh   20     86        Bad  don't know  australia
5  abhishek   23     90    Average  don't know      Japan

In [73]:
#fixing a  incomplete data
#first creating a rnadom series
dic={"A":[1,2,3],"B":[4,np.nan,6],"C":[7,np.nan,9]}
S=pd.DataFrame(dic)

In [74]:
S

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  9.0

In [75]:
#dropping nan row
S.dropna()

   A    B    C
0  1  4.0  7.0
2  3  6.0  9.0

In [76]:
#dropping a column 
S.dropna(axis=1)

   A
0  1
1  2
2  3

In [77]:
#Set Threshold
S.dropna(thresh=2,axis=0)

   A    B    C
0  1  4.0  7.0
2  3  6.0  9.0

In [78]:
#replace with values
S.fillna(value=9)

   A    B    C
0  1  4.0  7.0
1  2  9.0  9.0
2  3  6.0  9.0

In [79]:
S

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  9.0

In [80]:
S.fillna(value=S["B"].sum(),inplace=True)
S

   A     B     C
0  1   4.0   7.0
1  2  10.0  10.0
2  3   6.0   9.0

In [81]:
S.groupby("B").size()

B
4.0     1
6.0     1
10.0    1
dtype: int64

In [82]:
data = {
    "company_name": ["Company A", "Company B", "Company C", "Company D", "Company E", 
                     "Company F", "Company G", "Company H", "Company I", "Company J"],
    "salary": [50000, 60000, 55000, 70000, 65000, 60000, 58000, 62000, 72000, 68000],
    "employee_name": ["Alice", "Bob", "Charlie", "David", "Eve", 
                      "Frank", "Grace", "Hannah", "Ivy", "Jack"]
}
A=pd.DataFrame(data)
A

  company_name  salary employee_name
0    Company A   50000         Alice
1    Company B   60000           Bob
2    Company C   55000       Charlie
3    Company D   70000         David
4    Company E   65000           Eve
5    Company F   60000         Frank
6    Company G   58000         Grace
7    Company H   62000        Hannah
8    Company I   72000           Ivy
9    Company J   68000          Jack

In [89]:
c=A.groupby("employee_name")

In [91]:
c

In [93]:
c.sum()

              company_name  salary
employee_name
Alice            Company A   50000
Bob              Company B   60000
Charlie          Company C   55000
David            Company D   70000
Eve              Company E   65000
Frank            Company F   60000
Grace            Company G   58000
Hannah           Company H   62000
Ivy              Company I   72000
Jack             Company J   68000

In [97]:
c.max()

              company_name  salary
employee_name
Alice            Company A   50000
Bob              Company B   60000
Charlie          Company C   55000
David            Company D   70000
Eve              Company E   65000
Frank            Company F   60000
Grace            Company G   58000
Hannah           Company H   62000
Ivy              Company I   72000
Jack             Company J   68000

In [99]:
#Creating a DataFrame
DIC= {"Corporation":["apple","google" ,"Meta", "apple","google","Meta"],
      "Employees": ["Alice","bob","Charlie","david","eve","grace"],
      "Salary":[2000,1500,3500,4500,2000,1500]} 
df=pd.DataFrame(DIC)

In [101]:
df

  Corporation Employees  Salary
0       apple     Alice    2000
1      google       bob    1500
2        Meta   Charlie    3500
3       apple     david    4500
4      google       eve    2000
5        Meta     grace    1500

In [106]:
c=df.groupby("Corporation")

In [108]:
c

In [112]:
c.sum()

                Employees  Salary
Corporation
Meta         Charliegrace    5000
apple          Alicedavid    6500
google             bobeve    3500

In [114]:
A

  company_name  salary employee_name
0    Company A   50000         Alice
1    Company B   60000           Bob
2    Company C   55000       Charlie
3    Company D   70000         David
4    Company E   65000           Eve
5    Company F   60000         Frank
6    Company G   58000         Grace
7    Company H   62000        Hannah
8    Company I   72000           Ivy
9    Company J   68000          Jack

In [116]:
A["employee_name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: employee_name, dtype: object

In [124]:
pd.DataFrame(A["salary"].value_counts())

        count
salary
60000       2
50000       1
55000       1
70000       1
65000       1
58000       1
62000       1
72000       1
68000       1

In [134]:
A["salary"].unique()

array([50000, 60000, 55000, 70000, 65000, 58000, 62000, 72000, 68000],
      dtype=int64)

In [136]:
pd.DataFrame(A["salary"].unique() ).head()

       0
0  50000
1  60000
2  55000
3  70000
4  65000

In [138]:
df

  Corporation Employees  Salary
0       apple     Alice    2000
1      google       bob    1500
2        Meta   Charlie    3500
3       apple     david    4500
4      google       eve    2000
5        Meta     grace    1500

In [142]:
#Creating A function
def Times1000(n) :
    return format(n*1000,",d")

pd.DataFrame(df["Salary"].apply(Times1000))

      Salary
0  2,000,000
1  1,500,000
2  3,500,000
3  4,500,000
4  2,000,000
5  1,500,000

In [148]:
#Creating a function That add a last name
def add(name) :
    if name == "Alice" :
        return "Alice Nepal"
    else: 
        return "Not Important" 
pd.DataFrame(df["Employees"].apply(add))

       Employees
0    Alice Nepal
1  Not Important
2  Not Important
3  Not Important
4  Not Important
5  Not Important

In [152]:
#use of lambda function 
pd.DataFrame(df["Salary"].apply(lambda x: format(x*1000,",d")))

      Salary
0  2,000,000
1  1,500,000
2  3,500,000
3  4,500,000
4  2,000,000
5  1,500,000

In [154]:
#applying a function on multiple of column 
#Creating a function ::

In [156]:
def namer(x) :
    return "Ravi:" + x
df[["Corporation","Employees"]]=pd.DataFrame(df[["Corporation","Employees"]].apply(namer))

In [158]:
df

   Corporation     Employees  Salary
0   Ravi:apple    Ravi:Alice    2000
1  Ravi:google      Ravi:bob    1500
2    Ravi:Meta  Ravi:Charlie    3500
3   Ravi:apple    Ravi:david    4500
4  Ravi:google      Ravi:eve    2000
5    Ravi:Meta    Ravi:grace    1500

In [168]:
#Sorting and ordering data
df.sort_values("Salary",ascending=True)

   Corporation     Employees  Salary
1  Ravi:google      Ravi:bob    1500
5    Ravi:Meta    Ravi:grace    1500
0   Ravi:apple    Ravi:Alice    2000
4  Ravi:google      Ravi:eve    2000
2    Ravi:Meta  Ravi:Charlie    3500
3   Ravi:apple    Ravi:david    4500

In [174]:
df.sort_values("Salary",ascending=False,inplace=True)

In [178]:
df.sort_values("Employees",ascending=True)

   Corporation     Employees  Salary
0   Ravi:apple    Ravi:Alice    2000
2    Ravi:Meta  Ravi:Charlie    3500
1  Ravi:google      Ravi:bob    1500
3   Ravi:apple    Ravi:david    4500
4  Ravi:google      Ravi:eve    2000
5    Ravi:Meta    Ravi:grace    1500

In [180]:
df

   Corporation     Employees  Salary
3   Ravi:apple    Ravi:david    4500
2    Ravi:Meta  Ravi:Charlie    3500
0   Ravi:apple    Ravi:Alice    2000
4  Ravi:google      Ravi:eve    2000
1  Ravi:google      Ravi:bob    1500
5    Ravi:Meta    Ravi:grace    1500